+++
title= "@@html:<input type=\"checkbox\" checked class=\"done\" style=\"transform: scale(1.4); vertical-align: middle; margin-right: 8px;\"/>@@Lambda Functions in Python"
tags= ["functional-programming"]
+++

{{< collapse id="python-lambda" lvl="3" >}}

Source: https://www.w3resource.com/python-exercises/lambda/index.php

*** soln
#+begin_src jupyter-python :session lambda-python
  remove_words = lambda lw, rw: [word for word in lw if word not in rw]
  print(remove_words(['orange', 'red', 'green', 'blue', 'white', 'black'], ['orange', 'black']))
#+end_src

#+RESULTS:
: ['red', 'green', 'blue', 'white']

